Repository: EDUlib/programs
Catalog: programs/conf/locale/*/LC_MESSAGES/django.po
Languages: ar, es_419, fr_ca, he, ka, ko_kr, zh_tw

source: When creating a Program, '{status}' is not a valid choice.
ar: عند إنشاء برنامج، لا يُعد '{status}' خيار صالح.
es_419: Cuando se crea un programa, '{status}' no es una opción valida.
fr_ca: Lors de la création d'un Programme, '{status}' n'est pas un choix valide.
he: בזמן יצירת תכנית, '{status}' אינו אפשרות זמינה.
ka: პროგრამის შექმნისას '{status}' დაუშვებელი არჩევანია.
ko_kr: 프로그램 생성 시, '{status}'는 유효하지 않은 선택입니다.
zh_tw: 創建課程時，“{status}”不是有效的選擇。

source: Provide exactly one valid/existing Organization while creating a Program.
ar: اذكر منظمة واحدة صالحة/قائمة اثناء انشاء البرنامج.
es_419: Proporciona solamente una organización valida/existente mientras se crea un programa,
fr_ca: Fournir exactement une organisation valide / existante lors de la création d'un programme.
he: ציין ארגון אחד קיים/תקף בזמן יצירת תכנית.
ka: პროგრამის შექმნისას, მიუთითეთ ერთი ნამდვილი/არსებული ორგანიზაცია.
ko_kr: 프로그램 생성 시 하나의 유효한/존재하는 기관을 입력하세요.
zh_tw: 在創建課程時，請提供一個有效/已存在的組織。

source: Provided Organization with key '{org_key}' doesn't exist.
ar: المنظمة المذكورة ذات المفتاح '{org_key}' غير موجودة
es_419: La organización proporcionada con la clave '{org_key}' no existe.
fr_ca: L'organisation fournie avec la clé '{org_key}' n'existe pas.
he: הארגון שצוין, בעל המפתח '{org_key}', אינו קיים.
ka: მითითებული ორგანიზაცია '{org_key}' გასაღებით არ ასებობს.
ko_kr: 입력한 '{org_key}' 키의 기관은 존재하지 않습니다.
zh_tw: 提供的組織關鍵字 '{org_key}' 不存在。

source: Personal info
ar: المعلومات الشخصية
es_419: Información personal
fr_ca: Informations personnelles
he: מידע אישי
ka: პირადი ინფორმაცია
ko_kr: 개인 정보
zh_tw: 個人資訊

source: Permissions
ar: صلاحيات
es_419: Permisos
he: הרשאות
ka: უფლებები
ko_kr: 허용
zh_tw: 權限

source: Important dates
ar: تواريخ مهمّة
es_419: Fechas importantes
fr_ca: Dates importantes
he: תאריכים חשובים
ka: მნიშვნელოვანი თარიღები
ko_kr: 중요한 날짜
zh_tw: 重要日期

source: Full Name
ar: الاسم الكامل
es_419: Nombre completo
fr_ca: Nom complet
he: שם מלא
ka: სრული სახელი
ko_kr: 실명
zh_tw: 全名

source: The file must be one of the following types: {valid_file_types}.
ar: يجب أن يكون نوع الملف من أحد الأنواع التالية: {valid_file_types}.
es_419: El archivo debe ser de uno de las siguientes tipos: {valid_file_types}.
fr_ca: Le fichier doit être d'un des types suivants : {valid_file_types}.
he: הקובץ חייב להיות אחד מהסוגים הבאים: {valid_file_types}.
ka: დაშვებულია მხოლოდ შემდეგი გაფართოების ფაილები: {valid_file_types}.
ko_kr: 파일은 다음과 같은 형식을 가져야 합니다: {valid_file_types}.
zh_tw: 檔案必須為以下其中一項樣式：{valid_file_types}。

source: The Content-Type header for this file does not match the file data. The file may be corrupted.
ar: إن ترويسة نوع-المحتوى الخاصة بهذا الملف غير مطابقة لبياناته. قد يكون الملف تالف.
es_419: El encabezado Content-Type para este archivo no coincide con los datos del archivo. El archivo debe estar corrupto.
fr_ca: L'entête de Content-Type pour ce fichier ne correspond pas aux données du fichier. Le fichier est peut-être corrompu.
he: כותרת סוג התוכן עבור קובץ זה אינה תואמת לנתוני הקובץ. ייתכן שהקובץ פגום.
ka: ფაილის Content-Type ჰედერი არ ემთხვევა ფაილის მონაცემებს. შესაძლოა ფაილი დაზიანებულია.
ko_kr: 이 파일의 Content-Type 제목이 파일 데이터와 일치하지 않습니다. 파일이 손상됬을 수 있습니다.
zh_tw: 此檔案內容類型標題不匹配檔案數據。該檔案可能已損壞。

source: The file name extension for this file does not match the file data. The file may be corrupted.
ar: لا يتطابق امتداد اسم هذا الملف مع بياناته. قد يكون الملف تالف.
es_419: El nombre de extensión del archivo no corresponde con los datos del mismo. El archivo debe estar corrupto.
fr_ca: L'extension du nom de fichier ne correspond pas aux données du fichier. Le fichier est peut-être corrompu.
he: תוסף השם של הקובץ עבור קובץ זה אינו תואם לנתוני הקובץ. ייתכן שהקובץ פגום.
ka: ამ ფაილის სახელის გაფართოება არ ემთხვევა მის მონაცემებს. შესაძლოა ფაილი დაზიანებულია.
ko_kr: 파일 이름 확장자가 파일 데이터와 일치하지 않습니다. 파일이 손상됬을 수 있습니다.
zh_tw: 擴展之檔案名稱不匹配檔案數據。該檔案可能已損壞。

source: The file must be at least {minimum_width} pixels wide and {minimum_height} pixels high.
ar: يجب أن يكون الملف بعرض {minimum_width} بيكسل على الأقل وبارتفاع {minimum_height} بيكسل على الأقل.
es_419: El archivo debe ser al menos {minimum_width} pixeles de ancho y {minimum_height} de alto.
fr_ca: Le fichier doit être au moins de {minimum_width} pixels large et {minimum_height} pixels haut.
he: הקובץ חייב להיות ברוחב {minimum_width} פיקסלים לפחות ובגובה {minimum_height} פיקסלים.
ka: ფაილი უნდა იყოს სულ მცირე {minimum_width} პიქსელის სიგანისა და {minimum_height} პიქსელი სიმაღლის.
ko_kr: 파일의 폭은 {minimum_width} 픽셀 이상, 높이는 {minimum_height} 픽셀 이상이어야 합니다.
zh_tw: 該文件必須至少為{minimum_width}像素寬和{minimum_height}像素高。

source: The user-facing display name for this Program.
ar: اسم هذا البرنامج المعروض للمستخدم .
es_419: Nombre para mostrar de este programa.
fr_ca: Le nom d'affichage public de ce programme.
he: כותרת שם הקמפוס של המשתמש לתכנית זו.
ka: პროგრამის მომხმარებელთან ასახული სახელი.
ko_kr: 사용자가 보는 프로그램 표시명.
zh_tw: 使用端顯示此課程名稱。

source: A brief, descriptive subtitle for the Program.
ar: عنوان فرعي وصفي مختصر للبرنامج.
es_419: Breve descripción del problema
fr_ca: Un bref sous-titre descriptif pour le Programme.
he: כותרת קצרה ותיאורית של התכנית.
ka: პროგრამის მოკლე, აღწერითი ქვესათაური
ko_kr: 프로그램에 대한 소개를 나타내는 부제.
zh_tw: 該計畫一段簡要、描述性的副標題。

source: The category / type of Program.
ar: فئة/نوع البرنامج.
es_419: Categoría / Tipo de programa
fr_ca: La catégorie / type du Programme.
he: הקטגוריה / הסוג של התכנית.
ka: პროგრამის კატეგორია/ტიპი.
ko_kr: 프로그램 종류/형식.
zh_tw: 課程的類別/類型。

source: The lifecycle status of this Program.
ar: حالة دورة حياة هذا البرنامج.
es_419: Estado en el ciclo para este programa.
fr_ca: L'état du cycle de vie de ce programme.
he: סטטוס אורך החיים של תכנית זו.
ka: პროგრამის სიცოცხლის ციკლის სტატუსი.
ko_kr: 프로그램의 주기 상태.
zh_tw: 本計畫的生命週期狀態。

source: Slug used to generate links to the marketing site
ar: الشارة المستخدمة لإنشاء روابط إلى الموقع التسويقي
es_419: Slug usado para generar vínculos al sitio de marketing.
fr_ca: Ligne-bloc utilisé pour générer des liens vers le site de marketing
he: שימוש בסלאג ליצירת קישורים לאתר השיווק
ka: სლოგანი გამოიყენება მარკეტინგულ გვერდზე ბმულების გენერაციითვის
ko_kr: 마케팅 사이트 링크 생성을 위해 사용되는 slug
zh_tw: Slug將用於產生至營銷網站的連結。

source: Active XSeries Programs must have a valid marketing slug.
ar: يجب أن تملك برامج XSeries النشطة ختم تجاري صالح.
es_419: Los programas de XSeries activos deben tener un slug de marketing válido.
fr_ca: Les programmes XSeries actifs doivent disposer d'une ligne-bloc marketing valide.
he: תכניות XSeries פעילות חייבות להיות בעלות סלאג שיווקי תקף.
ka: Active XSeries პროგრამებს უნდა ჰქონდეთ მართებული მარკეტინგული სლოგანი.
ko_kr: 액티브 엑스 프로그램은 유효한 마케팅 slug가 있어야 합니다
zh_tw: 啟用系列課程，需要一個有效的行銷網址辨識碼。

source: The string value of an org key identifying this organization in the LMS.
ar: قيمة السلسلة في مفتاح org الذي يحدد المنظمة في LMS.
es_419: Cadena de texto que identifica a esta organización en el LMS.
fr_ca: La valeur de la chaîne d'une clé d'organisation identifiant cette organisation dans le LMS.
he: ערך המחרוזת מפתח הארגון המזהה את הארגון הזה במערכת ניהול למידה.
ka: სტრიქონის მნიშვნელობა org გასაღებისთვის, რომელიც LMS-ში ორგანიზაციის იდენტიფიკაციისთვის გამოიყენება.
ko_kr: 학습 관리 시스템에서 이 기관을 나타내는 기관 키의 스트링 값.
zh_tw: 在LMS中標識此組織關鍵字的字符串值。

source: The display name of this organization.
ar: اسم العرض لهذه المنظمة
es_419: Nombre para mostrar de esta organización.
fr_ca: Le nom d'affichage de cette organisation.
he: שם הקמפוס של הארגון הזה.
ka: ორგანიზაციის ხილვადი სახელი.
ko_kr: 이 기관의 표시명.
zh_tw: 顯示此組織的名稱。

source: Cannot associate multiple organizations with a program.
ar: لا يمكن ربط منظمات متعددة مع هذا البرنامج
es_419: No es posible asociar múltiples organizaciones con un programa.
fr_ca: Impossible d'associer plusieurs organisations à un programme.
he: לא ניתן לחבר ארגונים רבים לתכנית זו.
ka: პროგრამასთან მრავალი ორგანიზაციის დაკავშირება ვერ ხერხდება.
ko_kr: 프로그램에 여러 기관을 연동시킬 수 없습니다.
zh_tw: 無法將課程與多個組織產生關聯鍵結。

source: The 'course' part of course_keys associated with this course code, for example 'DemoX' in 'edX/DemoX/Demo_Course'.
ar: جزء "الدورة التعليمية" في course_keys المرتبطة مع رمز هذه الدورة التعليمية، على سبيل المثال 'DemoX' في 'EDX / DemoX / Demo_Course'.
es_419: La parte relacionada con el 'curso' en la cadena de texto que identifica a este curso. Por ejemplo 'DemoX' en 'edX/DemoX/Demo_Course'.
fr_ca: La partie 'cours' des clés de cours associées avec ce code de cours, par exemple 'DemoX' dans 'edX/DemoX/Demo_Course'.
he: חלק הקורס מתוך מפתחות קורס השייכת לקוד קורס זה, לדוגמה 'DemoX' שב-'edX/DemoX/Demo_Course'.
ko_kr: 이 강좌 코드와 연동된 course_keys 의 'course' 부분. 예를 들어 'edX/DemoX/Demo_Course' 의 'DemoX'.
zh_tw: 課程代碼與課程關鍵字中的'course'互相關聯，例如'edX / DemoX / Demo Course'中的'Demo'。

source: The display name of this course code.
ar: اسم العرض لرمز هذه الدورة التعليمية.
es_419: Nombre para mostrar de este código de curso.
fr_ca: Le nom d'affichage de ce code de cours.
he: שם הקמפוס של קוד קורס זה.
ka: კურსის კოდის ხილვადი სახელი.
ko_kr: 이 강좌 코드의 표시명.
zh_tw: 顯示此課程代碼。

source: Course code must be offered by the same organization offering the program.
ar: يجب عرض رمز الدورة التعليمية من قبل نفس المنظمة التي تقدم البرنامج.
es_419: El código de curso debe ser ofrecido por la misma organización que ofrece el programa.
fr_ca: Le code de cours doit être offert par la même organisation offrant le programme.
he: הארגון המציע את התכנית הזו חייב להציע גם קוד קורס.
ka: კურსის კოდი წარმოდგენილი უნდა იყოს პროგრამის წარმდგენი ორგანიზაციის მიერ.
ko_kr: 강좌 코드는 프로그램을 제공하는 기관과 동일한 기관이 제공해야 합니다.
zh_tw: 課程代碼必須由提供該課程的組織提供。

source: The URL of the LMS where this course run / mode is being offered.
ar: عنوان URL الخاص ب LMS حيث يتم تقديم مجرى / وضع هذه الدورة التعليمية.
es_419: La URL del LMS donde este curso / modo está siendo ofertado.
fr_ca: Le URL du LMS où cette instance / mode de cours est offert.
he: כתובת ה-URL של מערכת ניהול למידה בה מוצע מצב/ הרצת קורס.
ka: LMS-ის URL მისამართი, სადაც ამ კურსის გაშვების რეჟიმია შეთავაზებული.
ko_kr: 이 강좌 실행/모드가 제공되는 학습 관리 시스템의 URL.
zh_tw: 提供此課程運行/模式的LMS的URL。

source: A string referencing the course key identifying this run / mode in the target LMS.
ar: سلسلة التي تشير إلى مفتاح الدورة التعليمية التي تحدد هذا المجرى / الوضع في LMS الهدف.
es_419: Cadena de texto con la clave que identifica a este curso / modo en el LMS de destino.
fr_ca: Chaîne référençant la clé de cours identifiant cette instance / mode dans le LMS cible.
he: מחרוזת, המפנה למפתח קורס, מזהה הרצה/מצב זה במערכת לניהול הלמידה הייעודית.
ko_kr: 목표 학습 관리 시스템에서 이 강좌 실행/모드를 나타내는 강좌 키의 스트링.
zh_tw: 引用課程關鍵字在目標LMS中標識此課程運行/模式的字符串。

source: The mode_slug value which uniquely identifies the mode in the target LMS.
ar: قيمة mode_slug التي تعرف بشكل فريد الوضع في LMS الهدف.
es_419: Valor del mode_slug que identifica de forma única el modo en el LMS de destino.
fr_ca: Valeur mode_slug qui identifie de manière unique le mode dans le LMS cible.
he: ערך מצב הסלאג המזהה באופן ייחודי את המצב במערכת ניהול הלמידה הייעודית.
ko_kr: 목표 학습 관리 시스템에서 모드를 특정하는 mode_slug 값.
zh_tw: 在目標LMS中唯一辨識模式的mode_slug值。

source: The sku associated with this run/mode in the ecommerce system working with the target LMS.
ar: وحدة التخزين المرتبطة بهذا المجرى/الوضع في نظام التجارة الإلكترونية الذي يعمل مع LMS الهدف.
es_419: Código sku asociado con este curso / modo en el sistema de ecommerce que trabaja con el LMS de destino.
fr_ca: Le sku associé à cette instance / mode dans le système de commerce électronique fonctionnant avec le LMS cible.
he: יחידת SKU השייכת למצב/הרצה בעבודת מערכת ecommerce יחד עם המערכת לניהול למידה.
ko_kr: 목표 학습 관리 시스템에서 작동하는 전자 상거래 시스템 내 이 실행/모드와 연동된 sku.
zh_tw: 在與目標LMS一起運作的電子商務系統中與此運行/模式相關聯的sku。

source: The start date of this course run in the target LMS.
ar: تاريخ بدء مجرى الدورة التعليمية في LMS الهدف.
es_419: Fecha de inicio de este curso en el LMS de destino.
fr_ca: La date de début de cette instance de cours dans le LMS cible.
he: תאריך ההתחלה של הרצת הקורס הזה ביעד המערכת לניהול למידה, LMS.
ka: სამიზნე LMS-ში კურსის გაშვების საწყისი თარიღი.
ko_kr: 목표 학습 관리 시스템 내 강좌 실행 개시일.
zh_tw: 在目標LMS中的課程開課日期。

source: A string referencing the last part of course key identifying this course run in the target LMS.
ar: سلسلة التي تشير إلى الجزء الأخير من الدورة التعليمية التي مجرى الدورة التعليمية في LMS الهدف.
es_419: Cadena de texto que referencia la última parte de la llave de curso, que identifica esta convocatoria del curso en el LMS de destino.
fr_ca: Une chaîne référençant la dernière partie de la clé de cours identifiant cette instance de cours dans le LMS cible.
he: מחרוזת, המפנה לחלק האחרון של מפתח קורס, מזהה הרצה/מצב זה במערכת לניהול הלמידה הייעודית.
ko_kr: 목표 학습 관리 시스템에서 이 강좌 실행을 나타내는 강좌 키의 마지막 부분을 표시하는 스트링.
zh_tw: 引用課程關鍵字最後一個部份去標識在目標LMS中課程的運行的字符串。

source: Duplicate course run modes are not allowed for course codes in a program.
ar: لا يسمح بمجريات الدورات التعليمية المتطابقة في رموز الدورات في البرنامج.
es_419: No se permiten cursos / modos duplicados en cursos dentro de un programa.
fr_ca: Les modes d'instances de cours en double ne sont pas autorisés pour les instances de cours dans un programme.
he: אין אפשרות למצבי הרצת קורס כפולים בקודי קורס שבתכנית זו.
ka: პროგრამაში კურსის გაშვების დუბლირება კურსის კოდისთვის ნებადართული არ არის.
ko_kr: 프로그램에서 강좌 코드에 대해 중복된 강좌 실행 모드는 허용되지 않습니다.
zh_tw: 課程中的課程代碼不允許重複的課程運作模式。

source: Invalid course key.
ar: مفتاح الدورة التدريبية غير صالح.
es_419: Clave de curso no válida.
fr_ca: Clé de cours invalide.
he: מפתח הקורס אינו תקף.
ka: კურსის არასწორი გასაღები
ko_kr: 유효하지 않은 강좌키
zh_tw: 無效的課程關鍵字
